<?php

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 默认日志记录通道
    'default' => [
        "driver" => "log.driver",
        "type"   => "file"
    ],
    // 日志记录级别
    'level'        => [],
    // 日志类型记录的通道 ['error'=>'email',...]
    'type_channel' => [],

    // 日志通道列表

        'file' => [
            // 日志记录方式
            'type'           => 'File',
            // 日志保存目录
            'path'           => '',
            //文件的大小
            'file_size'   	=> 	'2830',
            // 最大日志文件数量
            'max_files'      => 0,
            // 使用JSON格式记录
            'json'           => true,
            // 关闭通道日志写入
            'close'          => false,
            // 是否实时写入
            'realtime_write' => false,
        ],
        // 其它日志通道配置


];
